// src/components/About.js
import React from 'react';
import './About.css';

const About = () => {
  return (
    <div className="about-page">
      <div className="container">
        <h2>Лягушки: Удивительные Создания Природы</h2>
        <h3>Строение и Анатомия</h3>
        <p>Лягушки — это амфибии, которые принадлежат к отряду бесхвостых (Anura). Они известны своим уникальным образом жизни, разнообразием видов и важной ролью в экосистемах. Лягушки обитают на всех континентах, кроме Антарктиды, и встречаются в самых различных средах обитания — от тропических лесов до пустынь.</p>

        <h3>Размножение и Жизненный Цикл</h3>
        <p>Лягушки размножаются в воде, откладывая яйца, которые развиваются в личинок — головастиков. Головастики имеют хвост и дышат с помощью жабр. По мере роста они проходят через метаморфоз, теряя хвост и развивая легкие, что позволяет им перейти к наземному образу жизни. Этот процесс может занять от нескольких недель до нескольких месяцев в зависимости от вида и условий окружающей среды.</p>

        <h3>Экологическая Роль</h3>
        <p>Лягушки играют важную роль в экосистемах. Они являются как хищниками, так и жертвами. Лягушки питаются насекомыми, что помогает контролировать их популяцию. В свою очередь, они сами служат пищей для многих животных, включая птиц, змей и млекопитающих. Таким образом, лягушки являются важным звеном в пищевой цепи.</p>

        <h3>Угрозы и Охрана</h3>
        <p>Несмотря на свою адаптивность, лягушки сталкиваются с множеством угроз, включая потерю среды обитания, загрязнение окружающей среды и изменение климата. Многие виды лягушек находятся под угрозой исчезновения. Охрана их естественной среды обитания и проведение исследований по их биологии и экологии являются важными шагами для сохранения этих удивительных существ.</p>
      </div>
    </div>
  );
};

export default About;